closedCavity/0.5m/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    hotWall
    {
        type            externalWallHeatFluxTemperature;
        mode            flux;
        q               uniform 1000;
        kappaMethod     fluidThermo;
        value           uniform 300;
    }
    insulatedWalls
    {
        type            zeroGradient;
    }
    ambientWalls
    {
        type            fixedValue;
        value           uniform 303;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
