closedCavity/0.5m/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.5e-8;

boundaryField
{
    hotWall
    {
        type            epsilonWallFunction;
        value           uniform 1.5e-8;
    }
    insulatedWalls
    {
        type            epsilonWallFunction;
        value           uniform 1.5e-8;
    }
    ambientWalls
    {
        type            epsilonWallFunction;
        value           uniform 1.5e-8;
    }
}


// ************************************************************************* //
